In [2]:
import numpy as np

In [3]:
A = np.array([[3, 2, 1, 4],
              [5, 2, 1, 6]])

B = np.array([[3, 2, 1, 4],
              [5, 2, 0, 6]])

C = np.array([[True, False, False],
              [True, True, True]])

D = np.array([0.1, 0.3])

In [11]:
for i,j in zip(list('ABCD') , [A,B ,C,D]):
    print(f"{i} : {np.all(j)}")

A : True
B : False
C : False
D : True

# Pandas 


- Data representation is better than numpy
- can store hetrogeneous data

In [12]:
import pandas as pd

In [ ]:
# We have 2 data structure 


1. Series --> 1D

2. Dataframe --> 2D

# Series

In [14]:
lst = ['Kaveri' , 'Ganga' , 'Yamuna' , 'Brahmaputra' , 'Krishna' , 'Godaveri' , 'Jehlum']



ser = pd.Series(lst)


print(ser , type(ser))

0         Kaveri
1          Ganga
2         Yamuna
3    Brahmaputra
4        Krishna
5       Godaveri
6         Jehlum
dtype: object <class 'pandas.core.series.Series'>

In [17]:
lst = ['Kaveri' , 'Ganga' , 'Yamuna' , 'Brahmaputra' , 'Krishna' , 'Godaveri' , 'Jehlum']



pd.Series(lst , index= ['a' , 'b' , 'c' , 'd' , 'e' , 'f' ,'g'])

a         Kaveri
b          Ganga
c         Yamuna
d    Brahmaputra
e        Krishna
f       Godaveri
g         Jehlum
dtype: object

In [21]:
lst = ('Kaveri' , 'Ganga' , 'Yamuna' , 'Brahmaputra' , 'Krishna' , 'Godaveri' , 'Jehlum')



pd.Series(lst , index= ['a' , 'b' , 'c' , 'd' , 'e' , 'f' ,'g'])

a         Kaveri
b          Ganga
c         Yamuna
d    Brahmaputra
e        Krishna
f       Godaveri
g         Jehlum
dtype: object

In [19]:
arr = np.random.randint(10 , 40 , size = (5,))

arr

array([10, 11, 22, 15, 30])

In [20]:
pd.Series(arr)

0    10
1    11
2    22
3    15
4    30
dtype: int32

In [ ]:
# Creating an array using dict

In [23]:
a = {'name' :'xyz' , 'age' :34 , 'salary':4353534}


pd.Series(a)

name          xyz
age            34
salary    4353534
dtype: object

In [24]:
a = {'name' :'xyz' , 'age' :34 , 'salary':4353534}


pd.Series(a , index = ['a' , 'age' , 'b'])

a      NaN
age     34
b      NaN
dtype: object

In [25]:
a = {'name' :'xyz' , 'age' :34 , 'salary':4353534}


pd.Series(a , index = ['name' , 'age' , 'adhar' , 'pan'])

name     xyz
age       34
adhar    NaN
pan      NaN
dtype: object

In [29]:
brics_country = ['Brazil', 'Russia', 'India', 'China', 'South Africa']

brics_currency = ['Real', 'Ruble', 'Rupee', 'Renminbi', 'Rand' ]

pd.Series(brics_currency , index = brics_country)

Brazil              Real
Russia             Ruble
India              Rupee
China           Renminbi
South Africa        Rand
dtype: object

In [30]:
lst = ('Kaveri' , 'Ganga' , 'Yamuna' , 'Brahmaputra' , 'Krishna' , 'Godaveri' , 'Jehlum')



ser = pd.Series(lst , index= ['a' , 'b' , 'c' , 'd' , 'e' , 'f' ,'g'])

ser

a         Kaveri
b          Ganga
c         Yamuna
d    Brahmaputra
e        Krishna
f       Godaveri
g         Jehlum
dtype: object

In [ ]:
# Zero indexing --> +ve , -ve

- start --> inclusive
- stop ---> exclusive

# custom indexing 


- start --> inclusive
- stop ---> inclusive

In [32]:
ser[3]

'Brahmaputra'

In [34]:
ser[-4]

'Brahmaputra'

In [36]:
ser['d']

'Brahmaputra'

In [37]:
ser

a         Kaveri
b          Ganga
c         Yamuna
d    Brahmaputra
e        Krishna
f       Godaveri
g         Jehlum
dtype: object

In [38]:
ser[1:4]

b          Ganga
c         Yamuna
d    Brahmaputra
dtype: object

In [40]:
ser['b' : 'e']

b          Ganga
c         Yamuna
d    Brahmaputra
e        Krishna
dtype: object

In [43]:
ser['f' :'b' : -2]

f       Godaveri
d    Brahmaputra
b          Ganga
dtype: object

In [45]:
ser.values

array(['Kaveri', 'Ganga', 'Yamuna', 'Brahmaputra', 'Krishna', 'Godaveri',
       'Jehlum'], dtype=object)

In [47]:
ser.index

Index(['a', 'b', 'c', 'd', 'e', 'f', 'g'], dtype='object')

In [48]:
ser

a         Kaveri
b          Ganga
c         Yamuna
d    Brahmaputra
e        Krishna
f       Godaveri
g         Jehlum
dtype: object

# Dataframe --> 2D

In [49]:
brics_country = ['Brazil', 'Russia', 'India', 'China', 'South Africa']

brics_currency = ['Real', 'Ruble', 'Rupee', 'Renminbi', 'Rand' ]

pd.Series(brics_currency , index = brics_country)

Brazil              Real
Russia             Ruble
India              Rupee
China           Renminbi
South Africa        Rand
dtype: object

In [52]:
brics_country = ['Brazil', 'Russia', 'India', 'China', 'South Africa']

brics_currency = ['Real', 'Ruble', 'Rupee', 'Renminbi', 'Rand' ]

pd.DataFrame([brics_country , brics_currency] , index = ['Col_1' , 'Col_2']).T

          Col_1     Col_2
0        Brazil      Real
1        Russia     Ruble
2         India     Rupee
3         China  Renminbi
4  South Africa      Rand

In [53]:
brics_country = ['Brazil', 'Russia', 'India', 'China', 'South Africa']

brics_currency = ['Real', 'Ruble', 'Rupee', 'Renminbi', 'Rand' ]

pd.DataFrame({'Col_1' : brics_country ,
             'Col_2' : brics_currency})

          Col_1     Col_2
0        Brazil      Real
1        Russia     Ruble
2         India     Rupee
3         China  Renminbi
4  South Africa      Rand

In [55]:
lst = ['Kaveri' , 'Ganga' , 'Yamuna' , 'Brahmaputra' , 'Krishna' , 'Godaveri' , 'Jehlum']
states = ['Karnataka' , 'UP' , 'Delhi' , 'Assam' , 'AP' , 'Maharastra' , 'Kashmir']

pd.DataFrame([states,lst],index=['States','Rivers']).T

       States       Rivers
0   Karnataka       Kaveri
1          UP        Ganga
2       Delhi       Yamuna
3       Assam  Brahmaputra
4          AP      Krishna
5  Maharastra     Godaveri
6     Kashmir       Jehlum

In [56]:
lst = ['Kaveri' , 'Ganga' , 'Yamuna' , 'Brahmaputra' , 'Krishna' , 'Godaveri' , 'Jehlum']
states = ['Karnataka' , 'UP' , 'Delhi' , 'Assam' , 'AP' , 'Maharastra' , 'Kashmir']

pd.DataFrame({'States' : states , 'Rivers' : lst})

       States       Rivers
0   Karnataka       Kaveri
1          UP        Ganga
2       Delhi       Yamuna
3       Assam  Brahmaputra
4          AP      Krishna
5  Maharastra     Godaveri
6     Kashmir       Jehlum

In [57]:
df_dict = {'Year' : [1990, 1994, 1998, 2002],
           'Country' : ['Italy', 'USA', 'France', 'Japan'],
           'Winner' : ['Germany', 'Brazil', 'France', 'Brazil'],
           'GoalScored' : [115, 141, 171, 161]
          }

pd.DataFrame(df_dict)

   Year Country   Winner  GoalScored
0  1990   Italy  Germany         115
1  1994     USA   Brazil         141
2  1998  France   France         171
3  2002   Japan   Brazil         161

In [58]:
df_dict = {'Year' : [1990, 1994, 1998, 2002],
           'Country' : ['Italy', 'USA', 'France', 'Japan'],
           'Winner' : ['Germany', 'Brazil', 'France', 'Brazil'],
           'GoalScored' : [115, 141, 171]
          }

pd.DataFrame(df_dict)

ValueError: All arrays must be of the same length

In [59]:
df_dict = {'Year' : pd.Series([1990, 1994, 1998, 2002]),
           'Country' : pd.Series(['Italy', 'USA', 'France', 'Japan']),
           'Winner' : pd.Series(['Germany', 'Brazil', 'France', 'Brazil']),
           'GoalScored' : pd.Series([115, 141, 171])
          }

pd.DataFrame(df_dict)

   Year Country   Winner  GoalScored
0  1990   Italy  Germany       115.0
1  1994     USA   Brazil       141.0
2  1998  France   France       171.0
3  2002   Japan   Brazil         NaN

In [60]:
df_dict = {'Year' : pd.Series([1990, 1994, 1998, 2002]),
           'Country' : pd.Series(['Italy', 'USA', 'France', 'Japan']),
           'Winner' : pd.Series(['Germany', 'Brazil', 'France', 'Brazil']),
           'GoalScored' : pd.Series([115, 141 , 161])
          }

pd.DataFrame(df_dict)

   Year Country   Winner  GoalScored
0  1990   Italy  Germany       115.0
1  1994     USA   Brazil       141.0
2  1998  France   France       161.0
3  2002   Japan   Brazil         NaN

In [61]:
df_dict = {'Year' : [1990, 1994, 1998, 2002],
           'Country' : ['Italy', 'USA', 'France', 'Japan'],
           'Winner' : ['Germany', 'Brazil', 'France', 'Brazil'],
           'GoalScored' : [115, 141, None , 161]
          }

pd.DataFrame(df_dict)

   Year Country   Winner  GoalScored
0  1990   Italy  Germany       115.0
1  1994     USA   Brazil       141.0
2  1998  France   France         NaN
3  2002   Japan   Brazil       161.0

# Load a data from an external source

In [63]:
df = pd.read_csv('datasets/ted_data.csv')

df

,name_speaker,speaker_occupation,title,views,comments
0,Ken Robinson,Author/educator,Do schools kill creativity?,47227110,4553
1,Al Gore,Climate advocate,Averting the climate crisis,3200520,265
2,David Pogue,Technology columnist,Simplicity sells,1636292,124
3,Majora Carter,Activist for environmental justice,Greening the ghetto,1697550,200
4,Hans Rosling,Global health expert; data visionary,The best stats you've ever seen,12005869,593
5,Tony Robbins,Life coach; expert in leadership psychology,Why we do what we do,20685401,672
6,Julia Sweeney,"Actor, comedian, playwright",Letting go of God,3769987,919
7,Joshua Prince-Ramus,Architect,Behind the design of Seattle's library,967741,46
8,Dan Dennett,"Philosopher, cognitive scientist",Let's teach religion -- all religion -- in sch...,2567958,582
9,Rick Warren,"Pastor, author",A life of purpose,3095993,900

In [68]:
df = pd.read_excel('datasets/football_worldcup.xlsx')

df

   Year       Country    Winner   Runners-Up  GoalsScored  MatchesPlayed
0  1990         Italy  Germany     Argentina          115             52
1  1994           USA    Brazil        Italy          141             52
2  1998        France    France       Brazil          171             64
3  2002         Japan    Brazil      Germany          161             64
4  2006       Germany     Italy       France          147             64
5  2010  South Africa     Spain  Netherlands          145             64
6  2014        Brazil   Germany    Argentina          171             64

In [69]:
df = pd.read_excel('datasets/automobile_camera.xlsx')

df

   Unnamed: 0                   car_name  mpg  horsepower origin_country
0           0     Toyota Corolla Mark ii   24          95          Japan
1           1  Chevrolet Chevelle Malibu   18         130             US
2           2                Audi 100 LS   24          90        Germany
3           3                   BMW 2002   26         113        Germany
4           4               Datsun PL510   27          88          Japan